#### 📖 Terraform Plan ('infra/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_app.azurerm_storage_account.static_content: Preparing import... [id=/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.function_app.azurerm_private_endpoint.st_blob will be created
  + resource "azurerm_private_endpoint" "st_blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-static-content-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-static-content-blob-pep-01"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.function_app.azurerm_private_endpoint.st_file will be created
  + resource "azurerm_private_endpoint" "st_file" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-static-content-file-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-static-content-file-pep-01"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.function_app.azurerm_private_endpoint.st_queue will be created
  + resource "azurerm_private_endpoint" "st_queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-static-content-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-static-content-queue-pep-01"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.function_app.azurerm_private_endpoint.st_table will be created
  + resource "azurerm_private_endpoint" "st_table" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-svc-app-be-static-content-table-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-svc-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-svc-app-be-static-content-table-pep-01"
          + private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "table",
            ]
        }
    }

  # module.function_app.azurerm_storage_account.static_content will be updated in-place
  # (imported from "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01")
  ~ resource "azurerm_storage_account" "static_content" {
        access_tier                       = "Hot"
        account_kind                      = "StorageV2"
        account_replication_type          = "ZRS"
        account_tier                      = "Standard"
        allow_nested_items_to_be_public   = false
      ~ cross_tenant_replication_enabled  = false -> true
        default_to_oauth_authentication   = false
        dns_endpoint_type                 = "Standard"
        enable_https_traffic_only         = true
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
        infrastructure_encryption_enabled = false
        is_hns_enabled                    = false
        large_file_share_enabled          = true
        local_user_enabled                = true
        location                          = "italynorth"
        min_tls_version                   = "TLS1_2"
        name                              = "iopitnsvcappbest01"
        nfsv3_enabled                     = false
        primary_access_key                = (sensitive value)
        primary_blob_connection_string    = (sensitive value)
        primary_blob_endpoint             = "https://iopitnsvcappbest01.blob.core.windows.net/"
        primary_blob_host                 = "iopitnsvcappbest01.blob.core.windows.net"
        primary_connection_string         = (sensitive value)
        primary_dfs_endpoint              = "https://iopitnsvcappbest01.dfs.core.windows.net/"
        primary_dfs_host                  = "iopitnsvcappbest01.dfs.core.windows.net"
        primary_file_endpoint             = "https://iopitnsvcappbest01.file.core.windows.net/"
        primary_file_host                 = "iopitnsvcappbest01.file.core.windows.net"
        primary_location                  = "italynorth"
        primary_queue_endpoint            = "https://iopitnsvcappbest01.queue.core.windows.net/"
        primary_queue_host                = "iopitnsvcappbest01.queue.core.windows.net"
        primary_table_endpoint            = "https://iopitnsvcappbest01.table.core.windows.net/"
        primary_table_host                = "iopitnsvcappbest01.table.core.windows.net"
        primary_web_endpoint              = "https://iopitnsvcappbest01.z38.web.core.windows.net/"
        primary_web_host                  = "iopitnsvcappbest01.z38.web.core.windows.net"
      ~ public_network_access_enabled     = true -> false
        queue_encryption_key_type         = "Service"
        resource_group_name               = "io-p-itn-svc-rg-01"
        secondary_access_key              = (sensitive value)
        secondary_connection_string       = (sensitive value)
        sftp_enabled                      = false
        shared_access_key_enabled         = true
        table_encryption_key_type         = "Service"
      ~ tags                              = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Enti & Servizi"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }

        blob_properties {
            change_feed_enabled           = false
            change_feed_retention_in_days = 0
            last_access_time_enabled      = false
            versioning_enabled            = false

            container_delete_retention_policy {
                days = 7
            }

            delete_retention_policy {
                days                     = 7
                permanent_delete_enabled = false
            }
        }

        network_rules {
            bypass                     = [
                "AzureServices",
            ]
            default_action             = "Allow"
            ip_rules                   = []
            virtual_network_subnet_ids = []
        }

        queue_properties {
            hour_metrics {
                enabled               = true
                include_apis          = true
                retention_policy_days = 7
                version               = "1.0"
            }
            logging {
                delete                = false
                read                  = false
                retention_policy_days = 0
                version               = "1.0"
                write                 = false
            }
            minute_metrics {
                enabled               = false
                include_apis          = false
                retention_policy_days = 0
                version               = "1.0"
            }
        }

        share_properties {
            retention_policy {
                days = 7
            }
        }
    }

  # module.function_app.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass                     = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action             = "Deny"
      + id                         = (known after apply)
      + ip_rules                   = (known after apply)
      + storage_account_id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbest01"
      + virtual_network_subnet_ids = (known after apply)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "FEATURED_ITEMS_BLOB_CONNECTION_STRING"           = (sensitive value)
            # (16 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01"
        name                                           = "io-p-itn-svc-app-be-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will be marked as sensitive and will not
          # display in UI output after applying this change. The value is unchanged.
          ~ "FEATURED_ITEMS_BLOB_CONNECTION_STRING"           = (sensitive value)
            # (16 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          ~ ip_restriction_default_action           = "Allow" -> "Deny"
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ allow_nested_items_to_be_public   = true -> false
        id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnsvcappbestfn01"
        name                              = "iopitnsvcappbestfn01"
      ~ shared_access_key_enabled         = true -> false
        tags                              = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to import, 5 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

Error: retrieving properties for Blob "featured-services.json" (Account "Account \"iopitnsvcappbestfn01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"blob\" / DomainSuffix \"core.windows.net\")" / Container Name "static-content"): executing request: unexpected status 403 (403 This request is not authorized to perform this operation using this permission.) with EOF

  with module.function_app.azurerm_storage_blob.featured_services,
  on ../_modules/function_app/storage_account.tf line 8, in resource "azurerm_storage_blob" "featured_services":
   8: resource "azurerm_storage_blob" "featured_services" {


Error: retrieving properties for Blob "featured-institutions.json" (Account "Account \"iopitnsvcappbestfn01\" (IsEdgeZone false / ZoneName \"\" / Subdomain Type \"blob\" / DomainSuffix \"core.windows.net\")" / Container Name "static-content"): executing request: unexpected status 403 (403 This request is not authorized to perform this operation using this permission.) with EOF

  with module.function_app.azurerm_storage_blob.featured_institutions,
  on ../_modules/function_app/storage_account.tf line 16, in resource "azurerm_storage_blob" "featured_institutions":
  16: resource "azurerm_storage_blob" "featured_institutions" {

::error::Terraform exited with code 1.
```

</details>
